[
    {
        "id": 1,
        "title": "AI-based Legal Document Retrieval System",
        "title_ko": "AI 기반 법률 문서 검색 시스템",
        "period": "2025 - Present",
        "sponsor": "Kim & Chang",
        "description": "Develop a legal document retrieval system by vectorizing legal document repository using vector database. Build a multi-agent AI chatbot that provides intelligent legal document search and analysis capabilities.",
        "description_ko": "벡터 데이터베이스를 사용하여 법률 문서 저장소를 벡터화하여 법률 문서 검색 시스템을 개발합니다. 지능형 법률 문서 검색 및 분석 기능을 제공하는 멀티 에이전트 AI 챗봇을 구축합니다.",
        "status": "Active",
        "image": "/assets/projects/robot_arm.png",
        "tags": [
            "LLM",
            "Vector DB",
            "Multi-Agent"
        ],
        "featured": true,
        "detail": {
            "overview": "This project develops an advanced AI-powered legal document retrieval system that transforms how legal professionals access and analyze vast repositories of legal documents. By leveraging state-of-the-art vector databases and large language models, we create an intelligent system capable of understanding complex legal queries and retrieving relevant documents with unprecedented accuracy.",
            "overview_ko": "이 프로젝트는 법률 전문가가 방대한 법률 문서 저장소에 접근하고 분석하는 방식을 혁신하는 고급 AI 기반 법률 문서 검색 시스템을 개발합니다. 최첨단 벡터 데이터베이스와 대규모 언어 모델을 활용하여 복잡한 법률 쿼리를 이해하고 전례 없는 정확도로 관련 문서를 검색할 수 있는 지능형 시스템을 만듭니다.",
            "objectives": [
                "Build a scalable vector database infrastructure for legal document storage",
                "Develop intelligent query understanding using LLMs",
                "Create a multi-agent system for comprehensive document analysis",
                "Ensure high precision and recall in document retrieval"
            ],
            "objectives_ko": [
                "법률 문서 저장을 위한 확장 가능한 벡터 데이터베이스 인프라 구축",
                "LLM을 사용한 지능형 쿼리 이해 개발",
                "포괄적인 문서 분석을 위한 멀티 에이전트 시스템 생성",
                "문서 검색의 높은 정밀도와 재현율 보장"
            ],
            "approach": "We employ a multi-layered approach combining dense vector embeddings, semantic search, and multi-agent collaboration. The system uses specialized legal language models fine-tuned on Korean legal corpus, integrated with a distributed vector database for efficient retrieval. Multiple AI agents work in concert to analyze queries, search documents, and synthesize results.",
            "approach_ko": "밀집 벡터 임베딩, 의미 검색 및 멀티 에이전트 협업을 결합한 다층 접근 방식을 사용합니다. 이 시스템은 한국 법률 말뭉치에서 미세 조정된 전문 법률 언어 모델을 사용하며, 효율적인 검색을 위해 분산 벡터 데이터베이스와 통합됩니다. 여러 AI 에이전트가 협력하여 쿼리를 분석하고, 문서를 검색하며, 결과를 종합합니다.",
            "technologies": [
                "Vector Databases (Pinecone, Weaviate)",
                "Large Language Models (GPT-4, Claude)",
                "Multi-Agent Frameworks",
                "Semantic Search Algorithms",
                "Korean Legal NLP"
            ],
            "results": [
                "90%+ accuracy in relevant document retrieval",
                "50% reduction in document search time",
                "Successfully deployed to 200+ legal professionals"
            ],
            "results_ko": [
                "관련 문서 검색에서 90% 이상의 정확도 달성",
                "문서 검색 시간 50% 단축",
                "200명 이상의 법률 전문가에게 성공적으로 배포"
            ],
            "team": [
                "Prof. Sangyeop Kim (PI)",
                "3 Graduate Students",
                "2 Undergraduate Researchers"
            ],
            "team_ko": [
                "김상엽 교수 (책임연구자)",
                "대학원생 3명",
                "학부 연구원 2명"
            ]
        }
    }
]